;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
(package! agent-shell :recipe (:host github :repo "xenodium/agent-shell") :pin "4f7055084c296f67643f633167dbb2abaa0ce10a")
(package! acp)
(package! flymake-ruff)
(package! flymake-shellcheck)
(package! flyspell-lazy)
(package! git-link)
(package! json-reformat)
(package! kanata-kbd-mode :recipe (:host github :repo "chmouel/kanata-kbd-mode" :files ("kanata-kbd-mode.el")) :pin "0315b567bd61951433c3bdb8e59160d77e1fdcda")
(package! popterm)
(package! powerthesaurus) ;; TODO https://github.com/SavchenkoValeriy/emacs-powerthesaurus
(package! ruff-format)
(package! shell-maker)
(package! string-inflection :recipe (:host github :repo "akicho8/string-inflection" :files ("string-inflection.el")) :pin "4a2f87d7b47f5efe702a78f8a40a98df36eeba13")
(package! transient-posframe :recipe (:host github :repo "yanghaoxie/transient-posframe" :files ("*.el")) :pin "dcd898d1d35183a7d4f2c8f0ebcb43b4f8e70ebe")
(package! vterm-toggle)
;; (package! ghostel)  ; built via nixpkgs + pre-built module, see default.nix
;; (package! activity-watch-mode)
;; (package! anki-editor)
;; (package! autothemer) ;; TODO
;; (package! bitwarden :recipe (:host github :repo "seanfarley/emacs-bitwarden" :files ("bitwarden.el")))
;; (package! blamer)
;; (package! burly)
;; (package! calibredb)
;; (package! chatgpt-arcana :recipe (:host github :repo "CarlQLange/ChatGPT-Arcana.el" :files ("*.el")))
;; (package! codeium :recipe (:host github :repo "Exafunction/codeium.el"))
;; (package! company-graphviz-dot)
;; (package! company-graphviz-dot)
;; (package! company-tabnine)
;; (package! copilot :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))
;; (package! counsel-spotify)
;; (package! crdt) ;; TODO
;; (package! ctable)
;; (package! deferred)
;; (package! dired-dragon :recipe (:host github :repo "jeetelongname/dired-dragon"))
;; (package! dirvish)
;; (package! eaf)
;; (package! elcord)
;; (package! emacs-bitwarden)
;; (package! emms)
;; (package! epc)
;; (package! evil-tree-edit) ;; TODO
;; (package! exwm)
;; (package! exwm-outer-gaps  :recipe (:host github :repo "lucasgruss/exwm-outer-gaps"))
;; (package! eziam-themes)
;; (package! fixed-pitch :recipe (:host github :repo "cstby/fixed-pitch-mode"))
;; (package! frog-jump-buffer)
;; (package! gitmoji :recipe (:host github :repo "janusvm/emacs-gitmoji" :files ("*.el" "data")))
;; (package! gptai)
;; (package! graphql-mode)
;; (package! graphviz-dot-mode)
;; (package! hass) ;; TODO home-assistant integration
;; (package! ibrowse :recipe (:host github :repo "nicolas-graves/ibrowse.el" :files ("*.el")))
;; (package! json5 :recipe (:host github :repo "nbfalcon/json5.el" :files ("*.el")))
;; (package! kbd-mode    :recipe (:host github :repo "kmonad/kbd-mode" :files ("kbd-mode.el")))
;; (package! leetcode)
;; (package! lsp-mode :pin "11c0c7af611ecb63f7797caae66fb03ba10c8c1e")
;; (package! lsp-tailwindcss :recipe (:host github :repo "merrickluo/lsp-tailwindcss")) ;; TODO
;; (package! magit-pretty-graph :recipe (:host github :repo "georgek/magit-pretty-graph" :files ("*.el")))
;; (package! magit-todos :disable t)
;; (package! md-roam :recipe (:host github :repo "nobiot/md-roam"))
;; (package! mermaid-mode)
;; (package! mini-frame)
;; (package! mini-modeline)
;; (package! mini-popup :recipe (:host github :repo "minad/mini-popup" :files ("*.el")))
;; (package! monkeytype)
;; (package! motoko-mode :recipe (:host github :repo "dfinity/motoko"  :files ("emacs/motoko-mode.el")))
;; (package! narrow-region-other-window)
;; (package! nov)
;; (package! nyan-mode)
;; (package! ob-mermaid)
;; (package! oj.el)
;; (package! org-ai)
;; (package! org-analyzer) ;; TODO
;; (package! org-anki :recipe (:host github :repo "smallstepman/org-anki" :files ("*.el")))
;; (package! org-caldav)
;; (package! org-excalidraw :recipe (:host github :repo "wdavew/org-excalidraw" :files ("*.el")))
;; (package! org-fragtog)
;; (package! org-jira)
;; (package! org-mind-map :recipe (:host github :repo "the-ted/org-mind-map" :files ("*.el")))
;; (package! org-noter)
;; (package! org-noter-pdftools)
;; (package! org-pdftools)
;; (package! org-roam-bibtex)
;; (package! org-roam-ui)
;; (package! org-transclusion)
;; (package! org-tree-slide)
;; (package! osm)
;; (package! popper)
;; (package! power-mode :recipe (:host github :repo "elizagamedev/power-mode.el" :files ("*.el")))
;; (package! shackle) ;; TODO
;; (package! soundklaus)
;; (package! spotify)
;; (package! svelte-mode)
;; (package! svg-tag-mode) ;
;; (package! tab-bar-echo-area)
;; (package! telega) ;; TODO
;; (package! toc-org)
;; (package! tree-edit) ;; TODO
;; (package! vc-msg)
;; (package! vertico-posframe :recipe (:host github :repo "tumashu/vertico-posframe")    :pin "cd54c3f022a47afc0a540eee117efc38289ae72d")
;; (package! vertico-posframe) ;; TODO
;; (package! vulpea)
;; (package! webkit :recipe (:host github :repo "akirakyle/emacs-webkit" :files ("*.js" "*.css" "*.el" "*.so" "*.h" "*.c" "Makefile")  :pre-build ("make")))
;; (package! websocket)
;; (package! which-key-posframe)
;; (package! xwwp :recipe (:host github :repo "BlueFlo0d/xwwp" :files ("*.el" "*.js" "*.css" "*" )))
;; (package! zoxide)
;; (unpin! dirvish)
;; (unpin! lsp-mode)
;; (unpin! rustic)
