;; -*- no-byte-compile: t; -*-
;;; $DOOMDIR/packages.el
(package! agent-shell :recipe (:host github :repo "xenodium/agent-shell") :pin "4f7055084c296f67643f633167dbb2abaa0ce10a")
(package! acp)
(package! flymake-ruff)
(package! flymake-shellcheck)
(package! flyspell-lazy)
(package! git-link)
(package! json-reformat)
(package! kanata-kbd-mode :recipe (:host github :repo "chmouel/kanata-kbd-mode" :files ("kanata-kbd-mode.el")) :pin "0315b567bd61951433c3bdb8e59160d77e1fdcda")
(package! leetcode)
(package! popterm)
(package! powerthesaurus)
(package! ruff-format)
(package! shell-maker)
(package! string-inflection :recipe (:host github :repo "akicho8/string-inflection" :files ("string-inflection.el")) :pin "4a2f87d7b47f5efe702a78f8a40a98df36eeba13")
(package! transient-posframe :recipe (:host github :repo "yanghaoxie/transient-posframe" :files ("*.el")) :pin "dcd898d1d35183a7d4f2c8f0ebcb43b4f8e70ebe")
(package! exercism :recipe (:host github :repo "canweriotnow/exercism-emacs" :files ("*.el")))
(package! vterm-toggle)
(package! combobulate :recipe (:host github :repo "mickeynp/combobulate") :pin "3946aa40ea7f41f1be43accd54ddb197dd403fd7")
(package! eldoc-box)
(package! consult-gh :recipe (:host github :repo "armindarvish/consult-gh" :files ("*.el")) :pin "7042619362cd47314d3d0f706fa9cac5bf07950c")
(package! sideline)
(package! sideline-eglot)
(package! python-pytest :recipe (:host github :repo "wbolster/emacs-python-pytest") :pin "8c0e048a771f355903a8c2ce78fa0974a077214e")
(package! uv :recipe (:host github :repo "johannes-mueller/uv.el" :files ("uv.el")) :pin "90f71913662982ffbac768ed5f0f6dc1d3bbd138")
(package! eca :recipe (:host github :repo "editor-code-assistant/eca-emacs" :files ("*.el")) :pin "f04a58052576789f1807112cb7494478bf45a412")
(package! minuet :recipe (:host github :repo "milanglacier/minuet-ai.el" :files ("*.el")) :pin "13fb314a795951b9190c53c59ef281abf7a2cb4f")
(package! typst-ts-mode :recipe (:host sourcehut :repo "meow_king/typst-ts-mode") :pin "1367003e2ad55a2f6f9e43178584683028ab56e9")

;; (package! activity-watch-mode)
;; (package! blamer)
;; (package! burly)
;; (package! calibredb)
;; (package! company-graphviz-dot)
;; (package! company-tabnine)
;; (package! copilot :recipe (:host github :repo "zerolfx/copilot.el" :files ("*.el" "dist")))
;; (package! evil-tree-edit) ;; TODO
;; (package! exwm)
;; (package! exwm-outer-gaps  :recipe (:host github :repo "lucasgruss/exwm-outer-gaps"))
;; (package! fixed-pitch :recipe (:host github :repo "cstby/fixed-pitch-mode"))
;; (package! frog-jump-buffer)
;; (package! gitmoji :recipe (:host github :repo "janusvm/emacs-gitmoji" :files ("*.el" "data")))
;; (package! graphviz-dot-mode)
;; (package! json5 :recipe (:host github :repo "nbfalcon/json5.el" :files ("*.el")))
;; (package! magit-pretty-graph :recipe (:host github :repo "georgek/magit-pretty-graph" :files ("*.el")))
;; (package! magit-todos :disable t)
;; (package! md-roam :recipe (:host github :repo "nobiot/md-roam"))
;; (package! mermaid-mode)
;; (package! narrow-region-other-window)
;; (package! nyan-mode)
;; (package! ob-mermaid)
;; (package! oj.el)
;; (package! org-analyzer) ;; TODO
;; (package! org-excalidraw :recipe (:host github :repo "wdavew/org-excalidraw" :files ("*.el")))
;; (package! org-fragtog)
;; (package! org-jira)
;; (package! org-mind-map :recipe (:host github :repo "the-ted/org-mind-map" :files ("*.el")))
;; (package! org-noter)
;; (package! org-noter-pdftools)
;; (package! org-pdftools)
;; (package! org-roam-bibtex)
;; (package! org-roam-ui)
;; (package! org-transclusion)
;; (package! org-tree-slide)
;; (package! toc-org)
;; (package! popper)
;; (package! vulpea)
;; (package! power-mode :recipe (:host github :repo "elizagamedev/power-mode.el" :files ("*.el")))
;; (package! shackle) ;; TODO
;; (package! tab-bar-echo-area)
;; (package! tree-edit) ;; TODO
;; (package! vc-msg)
;; (package! vertico-posframe :recipe (:host github :repo "tumashu/vertico-posframe")    :pin "cd54c3f022a47afc0a540eee117efc38289ae72d")
;; (package! vertico-posframe) ;; TODO
;; (package! webkit :recipe (:host github :repo "akirakyle/emacs-webkit" :files ("*.js" "*.css" "*.el" "*.so" "*.h" "*.c" "Makefile")  :pre-build ("make")))
;; (package! websocket)
;; (package! which-key-posframe)
;; (package! xwwp :recipe (:host github :repo "BlueFlo0d/xwwp" :files ("*.el" "*.js" "*.css" "*" )))
;; (package! zoxide)
